# Household income data clean up

In [ ]:
#Import libraries and dependencies
import pandas as pd

In [17]:
#Read in the CSV as Dataframe
household_income = pd.read_csv("../Data/RawData/HouseholdIncome.csv")

household_income.tail()

         Year  TotalIncome  TotalSavings
242  Mar-2020       422867         26916
243  Jun-2020       423192         52864
244  Sep-2020       449778         77169
245  Dec-2020       439923         33441
246  Mar-2021       431674         37720

In [21]:
#Drop unused columns
household_income_drop = household_income.iloc[143:246, :]
household_income_drop.head()

         Year  TotalIncome  TotalSavings
143  Jun-1995       107093           313
144  Sep-1995       110216          5510
145  Dec-1995       117273          5212
146  Mar-1996       112756          5320
147  Jun-1996       113630           853

In [24]:
# Select June only
household_income_june = household_income_drop[household_income_drop['Year'].str.contains('Jun-')]

household_income_june.head()

         Year  TotalIncome  TotalSavings
143  Jun-1995       107093           313
147  Jun-1996       113630           853
151  Jun-1997       120328          1617
155  Jun-1998       124565         -1596
159  Jun-1999       133049         -1208

In [33]:
# Remove 'Jun-' label from Year
household_income_june['Year'].replace(regex=True,inplace=True,to_replace='Jun-',value='')

household_income_june.head()

     Year  TotalIncome  TotalSavings
143  1995       107093           313
147  1996       113630           853
151  1997       120328          1617
155  1998       124565         -1596
159  1999       133049         -1208

# Saving the end result

In [ ]:
household_income_june.to_csv("../Data/ProcessedData/Household_Income_cleaned.csv")